In [1]:
import pandas as pd

In [2]:
import sqlite3

In [4]:
Create_table = """ Create Table student_score(id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""

In [5]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(Create_table)
executeSQL.commit()

In [6]:
SQL_query = executeSQL.execute('select * from student_score')

In [7]:
resulset = SQL_query.fetchall()

In [8]:
resulset

[]

In [9]:
insertSQL = [(10, 'Jack', 85, 92), (29, 'Tom', 73, 89), (65, 'Ram', 65.5, 77), (5, 'Steve', 55, 91)]

In [10]:
insert_statement = "insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [12]:
SQL_query = executeSQL.execute("select * from student_score")

In [13]:
resulset = SQL_query.fetchall()

In [14]:
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [18]:
df_student_records = pd.DataFrame(resulset, columns = list(zip(*SQL_query.description))[0])

In [19]:
df_student_records

   id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0